---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathCannotBeClosedLoopPath3d
source: html/1ebf8d26-9d26-185c-0bf8-5559a55c6ff3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathCannotBeClosedLoopPath3d Property

Path cannot be a closed loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathCannotBeClosedLoopPath3d { get; }
```